# FabricationHangerHostNotFound Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPFabricationFailures..::..FabricationHangerHostNotFound Property
BuiltInFailures..::..MEPFabricationFailures Class See Also
---
The hanger will disconnect because we can't find the suitable host.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FabricationHangerHostNotFound { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricationHangerHostNotFound As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FabricationHangerHostNotFound {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPFabricationFailures Class
Autodesk.Revit.DB Namespace